/**
  ******************************************************************************
  * @file    my_iwdg.c
  * @author  Falonss
  * @version V1.0.0
  * @date    2023.03.05
  * @brief   与看门狗有关的程序
  ******************************************************************************
**/
#include "my_iwdg.h"

/********************************************************
函数功能：重新配置看门狗的预分频和填充值                
入口参数：
返回  值：
*********************************************************/
void IWDG_ReloadNew(uint32_t Prescaler , uint32_t reload)		//reload只有12位
{
	hiwdg1.Init.Prescaler = IWDG_PRESCALER_32;
  hiwdg1.Init.Reload = reload;
	HAL_IWDG_Init(&hiwdg1);
}

/********************************************************
函数功能：看门狗重启               
入口参数：
返回  值：
*********************************************************/
void IWDG_Reset(void)
{
	hiwdg1.Init.Reload = 0x00;
	HAL_IWDG_Init(&hiwdg1);
}


